{
    "1": "A bet on which team will win the match. Options are usually: home team, draw, or away team.",
    "2": "A simplified bet on which team will win, excluding the possibility of a draw. Options are only the home team or the away team.",
    "3": "A bet on which team will win only the second half of the game, regardless of the final match outcome.",
    "4": "A bet that applies an advantage or disadvantage (handicap) to one team to balance the odds, typically useful when one team is strongly favored.",
    "5": "A bet on whether the total number of goals scored by both teams will be over or under a set value, such as 2.5 goals.",
    "6": "A bet on the total goals in the first half only, predicting if it will be over or under a specified number.",
    "7": "A double bet combining the outcome of the first half (HT) and the full match result (FT).",
    "8": "A bet on whether both teams will score at least one goal during the match, regardless of the final result.",
    "9": "A bet where the final result is modified by a predefined handicap applied to one team, leveling the playing field.",
    "10": "A bet predicting the exact scoreline of the match, such as 2-1 or 1-0.",
    "11": "A bet to predict which half will have the most goals scored: first half, second half, or equal scoring in both halves.",
    "12": "A safer bet allowing you to choose two of the three possible outcomes: home win or draw, away win or draw, or home or away win.",
    "13": "A bet on which team will be leading at the end of the first half, regardless of the full match result.",
    "14": "A bet on which team will score the first goal of the match.",
    "15": "A bet on which team will score the last goal before the match ends.",
    "16": "A bet predicting the total number of goals scored by the home team during the match.",
    "17": "A bet predicting the total number of goals scored by the away team during the match.",
    "18": "A bet on the first half result, modified by a handicap applied to one team.",
    "19": "An Asian handicap bet that applies only to the first half of the match.",
    "20": "A double chance bet applied only to the first half, allowing two possible outcomes for safety.",
    "21": "A bet on whether the total number of goals in the match will be an odd or even number.",
    "22": "A bet on whether the total number of goals in the first half will be odd or even.",
    "23": "A bet on whether the number of goals scored by the home team will be odd or even.",
    "24": "A combined bet predicting the match result and if both teams will score at least one goal.",
    "25": "A combined bet on the match outcome and the total number of goals scored.",
    "26": "A bet on whether the total goals scored in the second half will be over or under a specific number.",
    "27": "A bet on whether the home team will prevent the away team from scoring any goals.",
    "28": "A bet on whether the away team will prevent the home team from scoring any goals.",
    "29": "A bet on whether the home team will win without conceding any goals.",
    "30": "A bet on whether the away team will win without conceding any goals.",
    "31": "A bet predicting the exact score of the first half only.",
    "32": "A bet on whether one team will win both halves of the match individually.",
    "33": "A double chance bet applied only to the second half, allowing two possible outcomes for safety.",
    "34": "A bet on whether both teams will score at least one goal in the first half.",
    "35": "A bet on whether both teams will score at least one goal in the second half.",
    "36": "A bet on whether a team will win without conceding any goals during the entire match.",
    "37": "A bet on whether the home team will win both the first and second halves individually.",
    "38": "A bet on the exact number of goals scored by both teams in the entire match.",
    "39": "A bet on whether a specific team will win at least one half of the match.",
    "40": "A bet on the exact number of goals scored by the home team in the match.",
    "41": "A bet on the exact number of goals scored by the away team in the match.",
    "42": "A bet on the exact number of goals scored in the second half of the match.",
    "43": "A bet on whether the home team will score at least one goal during the match.",
    "44": "A bet on whether the away team will score at least one goal during the match.",
    "45": "A bet on whether the total number of corners will exceed a set number or fall below it.",
    "46": "A bet on the exact number of goals scored in the first half only.",
    "47": "A bet on the margin by which a team will win the match, such as by 1 or 2 goals.",
    "48": "A bet on whether a specific team will score at least one goal in both halves.",
    "49": "A combined bet on the total goals and whether both teams will score.",
    "50": "A flexible betting line predicting whether the total goals will exceed a specific mark, often adjusted during live play.",
    "51": "A combined bet on the halftime result and the total number of goals scored by the end of the match.",
    "52": "A combined bet on the halftime result and whether both teams will score at least one goal.",
    "53": "A bet on whether the away team will win both the first and second halves individually.",
    "54": "A bet on which team will be leading at the 10-minute mark in the first half.",
    "55": "A bet on which team will have more corners, with options for home, draw, or away.",
    "56": "An Asian handicap bet applied to the number of corners taken by each team.",
    "57": "A bet on whether the home team’s total corners will exceed a set number or fall below it.",
    "58": "A bet on whether the away team’s total corners will exceed a set number or fall below it.",
    "59": "A bet on whether there will be an own goal scored during the match.",
    "60": "A bet on whether the number of goals scored by the away team will be odd or even.",
    "61": "A bet on whether a team will advance to the next stage in a knockout or tournament setting.",
    "62": "A bet predicting the exact score of only the second half.",
    "63": "A bet on whether the total goals in the second half will be an odd or even number.",
    "72": "A flexible line for the first half, predicting if the total goals will exceed a specific mark.",
    "73": "A bet on whether both teams will score at least one goal in both halves.",
    "74": "A bet on whether the total goals will be over or under 10, usually for high-scoring matches.",
    "75": "A bet on which team will take the last corner kick of the match.",
    "76": "A bet on which team will take the first corner kick of the match.",
    "77": "A bet on the total number of corners taken in the first half.",
    "78": "A European handicap bet applied to the number of yellow or red cards.",
    "79": "A bet on whether the total number of cards will be over or under a specific value.",
    "80": "An Asian handicap bet applied to the number of cards awarded during the match.",
    "81": "A bet on the total number of cards received by the home team.",
    "82": "A bet on the total number of cards received by the away team.",
    "83": "A 3-way bet on the total corners in the first half (home, draw, away).",
    "84": "A 3-way bet on the total corners in the match (home, draw, away).",
    "85": "A bet on whether there will be a red card shown in the match.",
    "86": "A bet on the total number of shots on goal during the match.",
    "87": "A bet on the total shots on goal by the home team.",
    "88": "A bet on the total shots on goal by the away team.",
    "91": "A 3-way bet on the exact total number of goals scored (home, draw, away).",
    "92": "A bet on whether a specific player will score at any point during the match.",
    "93": "A bet on which player will score the first goal of the match.",
    "94": "A bet on which player will score the final goal of the match.",
    "95": "A bet on whether a specific player will score two or more goals.",
    "96": "A bet on which player will score the last goal of the match.",
    "97": "A bet on how the first goal will be scored, such as a header, penalty, or free-kick.",
    "99": "A bet on whether a penalty will be scored during the match.",
    "100": "A bet on whether a penalty will be missed during the match.",
    "111": "A bet on whether the home team will score at least one goal in both halves of the match.",
    "112": "A bet on whether the away team will score at least one goal in both halves of the match.",
    "113": "A bet on whether both teams will score at least one goal in both halves of the match.",
    "114": "A bet on whether the home team will score at least one goal in the first half.",
    "115": "A bet on whether the home team will score at least one goal in the second half.",
    "116": "A bet on whether the away team will score at least one goal in the first half.",
    "117": "A bet on whether the away team will score at least one goal in the second half.",
    "118": "A combined bet on the home team winning and the total goals being over a specified amount.",
    "119": "A combined bet on the home team winning and the total goals being under a specified amount.",
    "120": "A combined bet on the away team winning and the total goals being over a specified amount.",
    "121": "A combined bet on the away team winning and the total goals being under a specified amount.",
    "122": "A bet on whether the home team will win at least one half of the match.",
    "123": "A bet on whether the away team will win at least one half of the match.",
    "124": "A bet on whether the home team will come from behind and win the match.",
    "125": "An Asian handicap bet on the total number of corners in the first half.",
    "126": "An Asian handicap bet on the total number of corners in the second half.",
    "127": "A bet on the total number of corners taken in the second half.",
    "128": "A 3-way bet on the total corners in the second half (home, draw, away).",
    "129": "A bet on whether the away team will come from behind and win the match.",
    "130": "A 3-way bet on the number of corners in the first half.",
    "131": "A 3-way bet on the number of corners in the second half.",
    "132": "A bet on the total corners taken by the home team in the first half.",
    "133": "A bet on the total corners taken by the home team in the second half.",
    "134": "A bet on the total corners taken by the away team in the first half.",
    "135": "A bet on the total corners taken by the away team in the second half.",
    "136": "A 1x2 bet on the match result based on the first 15 minutes.",
    "137": "A 1x2 bet on the match result based on the first 60 minutes.",
    "138": "A 1x2 bet on the match result based on the first 75 minutes.",
    "139": "A 1x2 bet on the match result based on the first 30 minutes.",
    "140": "A double chance bet based on the result at the 30-minute mark.",
    "141": "A double chance bet based on the result at the 15-minute mark.",
    "142": "A double chance bet based on the result at the 60-minute mark.",
    "143": "A double chance bet based on the result at the 75-minute mark.",
    "144": "A bet on whether there will be a goal scored in the first 1-15 minutes.",
    "145": "A bet on whether there will be a goal scored in the 16-30 minute range.",
    "146": "A bet on whether there will be a goal scored in the 31-45 minute range.",
    "147": "A bet on whether there will be a goal scored in the 46-60 minute range.",
    "148": "A bet on whether there will be a goal scored in the 61-75 minute range.",
    "149": "A bet on whether there will be a goal scored in the 76-90 minute range.",
    "150": "A bet on the total yellow cards received by the home team.",
    "151": "A bet on the total yellow cards received by the away team.",
    "152": "An Asian handicap bet on the number of yellow cards.",
    "153": "A bet on whether the total number of yellow cards will be over or under a specified amount.",
    "154": "A double chance bet on the yellow cards.",
    "155": "A bet on whether the total yellow cards in the first half will be over or under a specific amount.",
    "156": "A bet on whether the total yellow cards in the second half will be over or under a specific amount.",
    "157": "A bet on whether the total yellow cards will be an odd or even number.",
    "158": "A 1x2 bet on the number of yellow cards.",
    "159": "An Asian handicap bet on the number of yellow cards in the first half.",
    "160": "An Asian handicap bet on the number of yellow cards in the second half.",
    "161": "A 1x2 bet on the number of yellow cards in the first half.",
    "162": "A 1x2 bet on the number of yellow cards in the second half.",
    "163": "A bet on whether a penalty will be awarded during the match.",
    "164": "A bet on the total number of offsides during the match.",
    "165": "A 1x2 bet on the number of offsides.",
    "166": "A handicap bet on the total offsides.",
    "167": "A bet on the total offsides by the home team.",
    "168": "A bet on the total offsides by the away team.",
    "169": "A double chance bet on the offsides.",
    "170": "A bet on the total fouls committed by the away team.",
    "171": "A bet on the total fouls committed by the home team.",
    "172": "A double chance bet on the fouls committed.",
    "173": "A bet on the total number of fouls committed during the match.",
    "174": "A handicap bet on the total fouls.",
    "175": "A 1x2 bet on the number of fouls.",
    "176": "A 1x2 bet on the shots on target.",
    "177": "A handicap bet on the shots on target.",
    "178": "A double chance bet on the shots on target.",
    "179": "A bet on which team will score the first goal of the match.",
    "180": "A bet on which team will score the last goal of the match.",
    "181": "A European handicap bet applied to the second half.",
    "182": "A draw no bet option applied to the second half.",
    "183": "A combined bet on double chance and total goals.",
    "184": "A bet on whether a specific team will score in both halves of the match.",
    "185": "A bet on which team will score first in a 3-way format for the first half.",
    "186": "A bet on the total goals by ranges across the entire match.",
    "187": "A bet on the total goals by ranges in the first half.",
    "188": "A bet on whether a team will keep a clean sheet (not concede any goals).",
    "189": "A handicap bet applied to a team advancing in a knockout stage.",
    "190": "A bet on the exact number of goals scored by the home team in the first half.",
    "191": "A bet on the exact number of goals scored by the away team in the first half.",
    "192": "A bet on which half will have the highest scoring for the home team.",
    "193": "A bet on which half will have the highest scoring for the away team.",
    "194": "A combined bet on the second half result and total goals.",
    "195": "A bet on whether either team will win by a margin of 1 goal.",
    "196": "A bet on whether either team will win by a margin of 2 goals.",
    "197": "A bet on the over/under goals scored between 15-30 minutes.",
    "198": "A bet on the over/under goals scored between 30-45 minutes.",
    "199": "A bet on whether the home team will win without conceding in the first half.",
    "200": "A bet on whether the home team will win without conceding in the second half.",
    "201": "A bet on whether a specific player or team will score in the first half.",
    "202": "A bet on whether a specific player or team will score in the second half.",
    "203": "A bet on whether the total yellow cards in the first half will be odd or even.",
    "204": "A bet on whether the total yellow cards in the second half will be odd or even.",
    "205": "A 3-way bet on which team will score first in the second half.",
    "206": "A bet on whether the home team will win without a draw option.",
    "207": "A bet on whether the away team will win without a draw option.",
    "208": "A 3-way bet on which team will take the first corner.",
    "209": "A bet on whether the home team will come from behind to draw the match.",
    "210": "A bet on whether the away team will come from behind to draw the match.",
    "211": "A bet on the total number of shots taken during the match.",
    "212": "A bet on the number of assists made by a specific player.",
    "213": "A bet on whether a player will achieve three specific statistical categories (such as points, assists, and rebounds) in a game.",
    "214": "A bet on the total points scored by a specific player.",
    "215": "A bet on the total number of singles (a type of scoring) achieved by a player.",
    "216": "A bet on whether a player will score two or more touchdowns.",
    "217": "A bet on whether a player will score three or more touchdowns.",
    "218": "A bet on whether an away team player will score at any time during the match.",
    "219": "A bet on who will score the first goal for the away team.",
    "220": "A bet on the total shots taken by the away team.",
    "221": "A bet on the total shots taken by the home team.",
    "222": "A bet on whether a team will win after initially falling behind.",
    "223": "A bet on the range of goals scored within the match.",
    "224": "A bet on whether the game will be decided after a penalty shootout.",
    "225": "A bet on whether the game will be decided in extra time.",
    "226": "A bet on who will score the last goal for the away team.",
    "227": "A bet on whether a goal will be scored by a header.",
    "228": "A bet on whether the home team will score a goal by a header.",
    "229": "A bet on whether a goal will be scored from outside the penalty box.",
    "230": "A bet on whether the home team will score a goal from outside the penalty box.",
    "231": "A bet on whether a specific player from the home team will score at any point during the match.",
    "232": "A bet on who will score the first goal for the home team.",
    "233": "A bet on who will score the last goal for the home team.",
    "234": "A bet on whether the home team will score three or more goals.",
    "235": "A bet on whether the away team will score three or more goals.",
    "236": "A bet on whether the away team will score two or more goals.",
    "237": "A bet on whether the home team will score two or more goals.",
    "238": "A bet on who will be the first goalscorer for the home team.",
    "239": "A European handicap bet applied to the number of corners.",
    "240": "A bet on the total shots taken by a player from the home team.",
    "241": "A bet on the total shots taken by a player from the away team.",
    "242": "A bet on the total shots on target by a specific player.",
    "243": "A bet on the total shots on target by the home team.",
    "244": "A bet on the total shots on target by the away team.",
    "245": "A bet on whether the away team will score a goal by a header.",
    "246": "A bet on whether the away team will score a goal from outside the penalty box.",
    "247": "A bet on which team will reach a certain number of corners first.",
    "248": "A bet on the time when the first score will happen in the match.",
    "249": "A bet on the combined number of corners in specific segments of the game.",
    "250": "A 3-way bet on which team will receive the first card of the match.",
    "251": "A bet on whether a specific player will receive a booking.",
    "252": "A bet on whether both teams will receive at least one card during the match.",
    "253": "A bet on the time of the first score in the match.",
    "254": "A range-based bet on the performance of a team within the match.",
    "255": "A bet on the total assists made by a player from the home team.",
    "256": "A bet on the total assists made by a player from the away team.",
    "257": "A bet on whether a player will either score or assist during the match.",
    "258": "A bet on whether a specific player from the home team will either score or assist during the match.",
    "259": "A bet on whether a specific player from the away team will either score or assist during the match.",
    "260": "A bet on the time when the first goal by a team will be scored.",
    "261": "A range-based bet on the total minutes of goals scored in the match.",
    "262": "A bet on whether a late goal will be scored within a specific time range.",
    "263": "A bet on whether an early goal will be scored within a specific time range.",
    "264": "A bet on the total shots on target by a specific player.",
    "265": "A bet on the total shots by a specific player during the match.",
    "266": "A bet on the total fouls committed by a specific player.",
    "267": "A bet on the total saves made by a goalkeeper.",
    "268": "A bet on the total saves made by the home team's goalkeeper.",
    "269": "A bet on the total shots on target by a specific home team player.",
    "270": "A bet on the total shots by a specific home team player.",
    "271": "A bet on the total fouls committed by a specific home team player.",
    "272": "A bet on the total tackles made by a specific home team player.",
    "273": "A bet on the total passes made by a specific home team player.",
    "274": "A bet on the total saves made by the away team's goalkeeper.",
    "275": "A bet on the total shots on target by a specific away team player.",
    "276": "A bet on the total shots by a specific away team player.",
    "277": "A bet on the total fouls committed by a specific away team player.",
    "278": "A bet on the total tackles made by a specific away team player.",
    "279": "A bet on the total passes made by a specific away team player.",
    "280": "A bet on the first set piece occurring within the first five minutes.",
    "281": "A bet on the total tackles made by both teams combined.",
    "282": "A combined bet on double chance and both teams to score.",
    "283": "A bet on whether the away team will win without conceding any goals in the first half.",
    "284": "A bet on whether the away team will win without conceding any goals in the second half.",
    "285": "A bet on whether a specific team will score a certain number of goals.",
    "286": "A bet on who will be the first goalscorer for a team.",
    "287": "A bet on who will be the last goalscorer for a team.",
    "288": "A bet on who will be the last goalscorer for the home team.",
    "289": "A bet on who will be the first goalscorer for the away team.",
    "290": "A bet on who will be the last goalscorer for the away team.",
    "291": "A range-based bet on the time of the first goal scored.",
    "292": "An over/under bet on goals scored between 0 and 10 minutes.",
    "293": "A double chance bet for the first 15 minutes of the match.",
    "294": "A double chance bet for the 15-30 minute range.",
    "295": "A range-based bet on the total number of corners in the match.",
    "296": "A double chance bet for the 30-45 minute range.",
    "297": "An over/under bet on the number of corners between 0 and 10 minutes.",
    "298": "A bet on the method by which victory is achieved.",
    "299": "An over/under bet on the total number of cards between 0 and 10 minutes.",
    "300": "A bet on whether both teams will receive at least two cards.",
    "301": "A bet on the total tackles made by the away team.",
    "302": "A bet on the total tackles made by the home team.",
    "303": "An over/under bet on a specific outcome within the first 10 minutes.",
    "304": "An over/under bet within the first 10 minutes of the match.",
    "305": "A bet on which team will reach the second goal first.",
    "306": "A bet on which team will reach the third goal first.",
    "307": "A double chance bet based on the total corners.",
    "308": "A race to a specific milestone within the match.",
    "309": "A bet on the total yellow cards received by the home team in the first half.",
    "310": "A bet on the total yellow cards received by the away team in the first half.",
    "311": "A bet on which team will score the first goal in the match.",
    "312": "A 1x2 bet (home win, draw, away win) based on the match outcome within the first 20 minutes.",
    "313": "A bet on whether the total offsides count will be an odd or even number.",
    "314": "A bet on whether the total fouls count will be an odd or even number.",
    "315": "A bet on the total number of saves made by both goalkeepers combined.",
    "316": "A 1x2 bet on which team will have the most saves (home win, draw, away win).",
    "317": "An Asian handicap bet applied to the number of saves made.",
    "318": "An over/under bet on the number of saves made by the home team.",
    "319": "An over/under bet on the number of saves made by the away team.",
    "320": "A double chance bet on the total saves, allowing two possible outcomes for safety.",
    "321": "A bet on whether a penalty will be awarded during the first half of the match.",
    "322": "A bet on whether a penalty will be awarded during the second half of the match.",
    "323": "A bet on whether the total number of saves will be odd or even.",
    "324": "A bet on whether a corner will be awarded in the first 1-15 minutes of the match.",
    "325": "A bet on whether a corner will be awarded in the 16-30 minute range.",
    "326": "A bet on whether a corner will be awarded in the 31-45 minute range.",
    "327": "A bet on whether a corner will be awarded in the 45-60 minute range.",
    "328": "A bet on whether a corner will be awarded in the 60-75 minute range.",
    "329": "A bet on whether a corner will be awarded in the 75-90 minute range.",
    "330": "A combined bet on the home team not losing and the total goals being over a set amount.",
    "331": "A combined bet on the home team not losing and the total goals being under a set amount.",
    "332": "A combined bet on the away team not losing and the total goals being over a set amount.",
    "333": "A combined bet on the away team not losing and the total goals being under a set amount.",
    "334": "A 1x2 bet (home win, draw, away win) based on the match outcome within the first 70 minutes.",
    "335": "An over/under bet on the total number of red cards shown in the match.",
    "336": "A flexible betting line predicting whether the total goals will exceed a specific mark."
  }
  